Repository: atlas-studios/Session2-G9
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 柳长老一看之下，脸色更加暴怒了几分，目光如刀子般在江逸脸上扫过，手上红色元力滚滚而出，就要一掌朝江逸拍下。
en_us: Upon looking into the cauldron, Elder Liu's wrath grew further. His gaze cut across Jiang Yi's face like a knife as the red essence force on his hand rolled. He was getting ready to hit Jiang Yi with one slap.

source: 柳长老不炼丹了，他可就没废丹了，也就不能炼制丹药卖钱了，凭他自己要想炼制丹药，那根本是不可能的事。
en_us: If Elder Liu stopped refining elixirs, he would not have any more rejected elixirs. This meant that he would no longer have any more refined elixirs to sell. It was an impossibility to even think of relying on himself alone to produce elixirs.

source: 柳长老不知道昨日那两枚地阶丹药是江逸注入了两缕黑色元力，以为是不小心添加了其他的药剂，让原本的丹方改变，错打错着炼出了地阶丹药。
en_us: Elder Liu did not know that the two Earth-tier elixir pills he got yesterday were created when Jiang Yi injected two wisps of essence force. Instead, he assumed that he had accidentally added other medicinal ingredients and changed the original elixir formula, wrongly and unintentionally refining an Earth-tier elixir.

source: 柳长老也被江逸惊醒，目光一扫，微微颔首道：“不错，比江松那个废物勤奋多了，对了……你叫什么来着？”
en_us: Elder Liu was similarly surprised by Jiang Yi. He glanced around the room before slightly nodding and saying, "Not bad, you're much more hardworking than that useless good-for-nothing Jiang Song. Right... What did you say your name was?"

source: 柳长老今天炼制的丹药还是昨日的灵神丹配方，不过每次都加了一种药剂，结果不用说——自然所有丹都废掉了，完全不是人阶上品修炼所用的灵神丹，更不可能是地阶丹药。
en_us: The elixir Elder Liu was refining today was based on the formula for Spirit Pills used the day before. However, every time he refined he added in a different additional medicinal ingredient. The conclusions need not be stated in deep detail - naturally, all the elixirs turned out to be useless, not at all the Man-tier superior-grade spirit pills that were supposed to be refined, to say nothing of them possibly being Earth-tier elixirs.

source: 柳长老刚才无视江逸，此刻等他一走倒是扭头过来，暗暗点头喃喃一句，继续配置药粉。
en_us: Elder Liu had ignored Jiang Yi earlier, but once Jiang Yi had left, he turned his head and silently nodded, before continuing to configure his elixir formula.

source: 柳长老完全无视江逸了，他一双牛眼瞪得滚圆，抓起丹炉内的两枚黑色丹药，满脸都是惊疑：“灵神丹不是白色的吗？这两枚怎么变成黑色的了？好像……药力增强了？”
en_us: Elder Liu completely ignored Jiang Yi. His eyes were wide as a full moon as he grabbed the two black pills from the cauldron, his face filled with shock and confusion as he said, "Isn't the Spirit Pill white in color? How did these two become black? And it seems like... their medicinal efficacy has increased in power!"

source: 柳长老已经死去了三天了，江逸每天都躲在自家后院修炼，让江小奴在前院守着。他内心有种深深的担忧，现在不在炼丹房做事了，家族很有可能会安排新的杂活给他，而荣管事也很有可能上门，取回西山药田令牌。
en_us: Elder Liu had been dead for three days. For all of the three days, Jiang Yi hid at home and cultivated his power in his backyard while letting Jiang Xiaonu keep watch in the front courtyard. He had a sense of concern deep in his heart. Now that he no longer worked at the alchemy lab, the family clan would very likely arrange odd jobs for him to work on; and Chief Rong would very likely come to his house and retrieve the command token for the Western Hills herb plantation.

source: 柳长老怒了，横眉竖眼骂道：“混账东西，这有什么难的，这炉丹药已经差不多好了，你只需朝这里注入元力，等丹药凝固成型就行，快滚过来！这事干不好，以后你别想在老夫这领一枚丹药，哼哼！”
en_us: Angered, Elder Liu scowled fiercely and reprimanded, "Damn it, this is not difficult at all—this cauldron is almost done anyway! All you need to do is to apply essence force towards this spot; it'll be done once the elixir solidifies and takes shape! Hurry up and get yourself over here! If you screw this up, don't ever think of collecting even a single elixir pill from here ever again! Hmph!"

source: 柳长老捧着剩下的那枚黑色丹药，摇头晃脑的走了，江逸却愁眉苦脸的差点要哭了。
en_us: Holding the remaining black elixir pill, Elder Liu left shaking his head. However, Jiang Yi remained looking miserable and was on the verge of crying.

source: 柳长老的古怪的脾气在江家是出了名的，所以江逸等江家子弟领丹药的时候，都喜欢避开他直接找江松领取，避免得罪了这个在家族地位举足轻重的怪老头。
en_us: Elder Liu was famous in the Jiang Clan for his weird temper, thus Jiang Yi and other Jiang Clan descendants preferred to avoid him and instead find Jiang Song when they came to collect elixirs, to avoid insulting or angering this weird old man that had an influential position in the family.

source: 柳长老的死因很快查出来了，让江逸没那么内疚的是，柳长老一直就有固疾，这几年前就曾犯病三次险些死去，这几天因没日没夜的钻研才提前归西了……
en_us: Elder Liu's cause of death was quickly revealed. What left Jiang Yi feeling less guilty was that Elder Liu was already suffering from an incurable disease. Over the past few years, he had three previous experiences where he had fallen ill but managed to avoid death. However, the non-stop study into the elixir over the past few days and nights had resulted in his early demise...

source: 柳长老的脸色却一下变了，一巴掌扫去，将进来的少年直接扫出大门外，这才冷哼道：“江松，你现在可以滚了，以后这炼丹房你不用来了，混账东西，天天就知道偷懒！”
en_us: Elder Liu's look transformed instantly and sent a slap at him, sending the youth entering the room flying out of the main doors. He then snorted coldly. "Jiang Song, you can get out of my sight now! You no longer need to return to this elixir-refining room. Damned thing, all you do is laze around!"

source: 柳长老终于醒悟过来，瞥了江逸一眼，不耐烦的说道：“去另外一边的丹房内自己拿吧，爱拿多少拿多少，别来烦老夫……咦？这灵神丹内还是原先的成分啊，并没有其余的成分啊？怎么会突然变成地阶了？奇怪，奇怪……”
en_us: Elder Liu finally came to his senses. Glancing at Jiang Yi with one look, he responded impatiently, "Go to the Elixir Room on the other side and take them yourself. Take as much as you want, and don't disturb me... Eh? This Spirit Pill still contains the original ingredients, and does not contain any extra components? How did it suddenly become Earth-tier? Strange, strange..."

source: 柳长老翻脸比翻书还快，又横眉竖眼怒道：“老夫要个人，别说那什么荣管事，就算内务堂大总管江云蛇都不敢说个不字。你去和你们管事说说，他敢不同意老夫撕了他。至于不懂炼丹，这慢慢学就是了，不过你可不能学江松那个废物偷懒，否则老夫饶不了你……就这么说定了，你先回去明早来这干活，老夫得去好好研究这丹药，哈哈哈，地阶丹药……”
en_us: Elder Liu's emotions changed faster than pages of a book being turned. He scowled fiercely and said angrily, "When I want someone, to say nothing of that Chief Rong, even the Internal Affairs Chief Supervisor Jiang Yunshe doesn't dare to say a word. “You go and tell your chief; if he doesn't agree, I will rip him to shreds. As for not knowing how to refine elixirs, this you can learn slowly. However, you cannot learn to be lazy like that good-for-nothing Jiang Song, or I will never let you off... That’s settled then. You can go back first, and come back here and work tomorrow morning. I have to go carefully research this elixir. Hahaha... Earth-tier elixir..."

source: 柳长老脸上突然露出笑容，走过来几步，大手在他右肩膀上拍了一下，咧嘴笑道：“你小子不错，是老夫的福将啊！嗯……江松那个废物我不要了，暂时也没人手帮忙，你以后就在这帮老夫炼丹吧。”
en_us: Elder Liu suddenly revealed a smile on his face. He walked forward by a few steps and slapped Jiang Yi's right shoulder with his large hand. Grinning widely, he said, "You're not bad, kid! You're my lucky charm! Hmmm... That useless good-for-nothing, Jiang Song—I don't want him anymore! Since I temporarily don't have any more people to help me, why don't you stay here and help me refine elixirs from now on?"

source: 柳长老脸色一沉，吹胡子瞪眼道：“你们这些废物子弟，天天不务正业，领丹药时就贼勤快，丹药？没有！”
en_us: Elder Liu's face turned dark, blew his beard and stared at Jiang Yi as he replied, "You useless sons, all of you never ever attend to your daily duties, yet during medicine collection time you guys become so efficiently quick! Elixirs? None!"

source: 柳长老越看眼睛越亮，神神叨叨说个不停：“这色泽，这药力，像，很像！老夫炼丹一辈子，难道……终于炼出两枚地阶的丹药了？”
en_us: Elder Liu's eyes brightened the more he looked. With much liveliness, he chattered non-stop. "This hue, this medical healing power... similar, very similar! I have refined elixirs all my life... could it be... finally two Earth-tier elixirs have been refined?"

source: 柳长老这几天肯定还会继续试验炼丹，只要不注入黑色元力，他就永远炼不出地阶丹药，那么就会有很多很多的废丹……
en_us: Elder Liu would definitely continue to experiment with elixir-refining for the next few days. So long as black essence force was not injected, he would always be unable to refine Earth-level elixirs—and that would mean there would be a lot of useless elixir pills...

source: 树林里幽暗阴森，地上铺满了腐败的落叶，每一脚踩下去，都好象踩在淤泥上一般不断往下陷去，那恶心的腐臭气息，更是熏得林立连眼都没法张开，黑暗中时而闪过几点幽幽的绿光，此起彼伏的狼嚎更是听得林立心惊胆战。
en_us: The woods were dark and gloomy, and the ground was covered with decaying leaves. His feet sank with every step he took, as if he was walking on mud. The rancid smell was so disgusting that Lin Li had trouble keeping his eyes open. Specks of faint green light flitted in the dark, and the incessant howls from the wolves struck fear into Lin Li's heart.

source: 根据这几名护卫的速度，江逸大概判断出四人的实力，内心也是一阵慌乱，如此多护卫他怎么应对？尤其是还有一人是铸鼎境三重。
en_us: From the speed of the few guards, Jiang Yi made a general judgment of four guards' strength. A wave of anxiety swept across his mind. How was he to handle that many guards? One of them was even at the third stage of the Cast Tripod Realm...

source: 梦魇草的汁液，正在烧杯中沸腾，林立手上拿着一朵宁神花，一瓣一瓣的小心撕着，这是一个很关键的过程，宁神花过多，会严重降低恐惧药剂的效果，而宁神花过少，却又无法达到镇定心神的目的，所以林立每撕下一瓣，都会轻轻摇动烧杯，等待宁神花完全融入药剂，才会根据颜色判断分量是否足够。
en_us: The succus from the nightmare seed was boiling in the beaker. Lin Li held a peacebloom in his hand, gingerly plucking the petals one by one. This was a very crucial process. The excessive use of peacebloom would seriously reduce the effect of the Fear Potion; and if there were too little peacebloom, it could not achieve the purpose of calming the mind. So, every time Lin Li tore a petal off, he would gently shake the beaker and wait for the petal to dissolve fully in the potion before judging whether the dose was enough according to the color.

source: 欢呼声将所有人都惊动了，包括老梅林与克伦威尔，他们纷纷投来各种各样的目光，有疑惑有惊喜也有怀疑。
en_us: The cheering alarmed everyone, including Old Merlin and Cromwell. All kinds of looks were shot in their direction, there were looks of doubt, surprise, and suspicion.

source: 欧灵没有说话，只是默默的望前走了一步，而这一步，也正好让他用身体将室友牢牢护住。
en_us: Orrin said nothing, but he quietly stepped forward, allowing him to use his body to safely protect his roommate.

source: 正在江逸沉吟时，柳长老突然抓起一枚黑色丹药吞了下去，然后就地闭目盘坐起来。只是片刻他就睁开了眼睛，一双牛眼内都是激动和狂喜：“哈哈哈，这的确是地阶下品丹药，三十年了！老夫终于炼出了地阶丹药啊，老夫终于不再是一品炼丹师了……”
en_us: Right as Jiang Yi was muttering to myself, Elder Liu suddenly grabbed one of the black elixir pills and swallowed it, before sitting cross-legged with his eyes closed. He opened his eyes almost instantly, his eyes filled with excitement and ecstasy. "Hahaha! This is indeed an Earth-tier inferior-grade elixir! It's been thirty years! I finally refined an Earth-tier elixir! I am no longer a first-rate elixir-refiner..."

source: 正在江逸迷茫之时，翊凌雪却郑重的从怀中取出一块令牌，说道：“我，翊凌雪代表翊家正式邀请你加入翊家，职位是武堂副长老，俸禄和待遇……”
en_us: While Jiang Yi was still in a daze, Yi Lingxue solemnly retrieved a command token from her chest pocket and said, "On behalf of the Yi Family, I, Yi Lingxue, formally invite you to join our family under the position of Deputy Elder of the family's martial arts training court. The remuneration will be.

source: 正在药剂室忙碌的林立，可一点也不知道葛瑞安如何恐吓那个倒霉的魔导士。
en_us: Lin Li, who was busy in the potion lab, had no idea how Gerian was intimidating the unlucky Magic Shooter.

source: 正在那僻静角落中，哭得梨花带雨的罗琳，也同样目睹了这惊心动魄的一幕，在那飞溅的火光映照下，罗琳泪痕未干的俏脸上，充满了惊骇欲绝的神色，红润的嘴唇微微张开，却又感觉心里有什么东西堵着，在这一瞬间，她竟是替那个年轻魔法师担心起来……
en_us: Rowling, who was weeping like a pear blossom bathed in rain in the secluded corner, had also witnessed the gripping scene. In the light of the spattering blaze, Rowling's tear-streaked pretty face was filled with horror and despair. Her ruddy lips slightly opened, but she felt something being blocked in her heart. At this moment, she was actually worried about the young mage...

source: 正在那犯难的时候，老格林却伸手指了指他身后：“就去那里坐坐吧。”
en_us: Just as he was at a loss, Old Grimm stretched out his hand and pointed in a direction behind him. "Let's sit there."

source: 正在那觉得委屈的时候，却听见身后一阵脚步声传来。
en_us: Just as he was feeling aggrieved, he heard footsteps shuffling from behind.

source: 正埋头想着心事，一行人却已走到了冒险者公会门外。
en_us: Just as he was absorbed in his thoughts, the party had reached the doorstep of the Adventurers Guild.

source: 正愉快交谈着的两人，谁也没有注意到，另一位魔法师的脸色有些发白。
en_us: Both of them were chatting merrily and had not noticed the other mage turning pale.

source: 正拼命逃跑的三人虽未被酸液溅到，却也因为躲避酸液而稍稍停住了脚步，这一停在平时可能没什么问题，但如今却正好让他们落入了双足飞龙的利爪之下，三人刚一抬头，就看见一片阴影在视线中飞快放大，锐利的爪子在黑暗中闪动着摄人的光亮。
en_us: The trio who were trying hard to escape were spared from the acid, but they had to stop in their tracks briefly to avoid it. Normally, it might not have been a problem, but at present, they happened to be under the talons of the Wyvern. As the trio looked up, they saw a shadow zooming in on them, sharp talons glimmering in the dark.

source: 正是因为这份野心，林立才从未停止过前进的脚步。
en_us: It was because of this ambition that Lin Li had never stopped moving forward.

source: 正有些疑惑之间，却忽然看见艾萨克带着红发美女，似乎正往自己坐的地方走来。
en_us: As he was still puzzling over it, he suddenly saw Isaac along with the redheaded beauty coming in the direction of where he was sitting.

source: 正有些疑惑的时候，林立忽然想起一个人来。
en_us: Lin Li was still in a daze when he suddenly recalled someone.

source: 正要开始萃取汁液的时候，却听见楼梯上又传来了一阵脚步声。
en_us: Just as he was beginning to extract the succus, he heard footsteps coming from the stairs.

source: 正要转身离去，却忽然感觉到，那一堆乱七八糟的东西当中，竟透出一股微弱的魔法波动。这种感觉对林立来说，实在是太熟悉了，不管是手上的无尽风暴之戒，还是身上的怒焰法袍，都总是在不经意间透出这种淡淡的魔法波动。
en_us: He was about to turn and leave when he suddenly felt a faint spell of magic in that mess. This feeling was too familiar to Lin Li. Whether it was the Ring of Endless Storm in his hand, or the Robe of Wrath on his body, they were constantly transmitting a slight wave of magic inadvertently.

source: 此刻他可不敢用真名，他很清楚这丹药既然惊动了姬家的小姐，肯定是对方察觉了黑色元力的特殊，匹夫无罪，怀璧其罪的道理他还是懂的。
en_us: He did not dare to use his real name at that moment. He was well aware that, being the case that the elixir had startled the young mistress of the Ji Family, the other party must have found out the special abilities of the black essence force. A man's wealth is his own ruin, for it encourages greed in others - he certainly understood this concept.

source: 此刻在武殿内闭关的公子小姐最少有二三十人，每天这群人中大半部分都会来这打上一两场，所以武殿内的陪练才会如此短缺。当然，根据江逸的猜测武殿内的陪练应该不止这么多，估计很多陪练都是被人打得重伤回去疗伤了，这群公子小姐可从不把陪练当人看的，出手没个轻重……
en_us: At present there were at least twenty or thirty young masters and mistresses in seclusion within the Martial Arts Hall. Every single day, more than half of this group of people would go up there to fight one or two matches. That was why there was such a severe shortage of sparring partners in the Martial Arts Hall. Of course, according to Jiang Yi's estimate, there should not be only so many sparring partners in the Martial Arts Hall. He guessed that many of the sparring partners had been beaten up severely and had left to recuperate from their injuries. This bunch of young masters and mistresses had after all never treated their sparring partners as fellow human beings, their attacks always being very heavy-handed and full of force...

source: 此刻外面剩下那个护卫本想跟着冲进来，却看到一道身影被踹飞出来，顿时吓得头一缩不敢冲了。如此短的时间内，江逸连续击伤两人，其中一人还是他们中最强的铸鼎境三重武者？试问这护卫怎么还敢冲进来主动挨打？
en_us: At this moment, the last remaining guard outside had thought of following his comrade and rushing in. However, seeing a figure be sent flying out by a single kick left him instantly shocked to the point that he withdrew his head and refused to rush in. In such a short period of time, Jiang Yi was able to consecutively attack and injure two people—and was one of the two not the strongest amongst them, a warrior at the third stage of the Cast Tripod Realm? How could this guard possibly dare to rush in now and end up getting thrashed?

source: 此刻江如虎来了，但他内心却没有一丝兴奋，反而满脸的苦涩，暗道自己太大意了。
en_us: At that moment, Jiang Ruhu had indeed arrived, but he did not have a shred of excitement deep in his heart. Rather, his face filled with bitterness and agony. He muttered to himself that he was too careless.

source: 此时一眼看见林立从炼金室出来，凯文就仿佛是见了救星一样，匆匆跟那几个头头交代了一声，赶紧落荒而逃。
en_us: He seemed to have found a savior when he saw Lin Li coming out from the alchemy lab. He excused himself from the leaders in a hurry and quickly fled away.

source: 此时众人望向林立的目光中，已经多多少少带着点别的意思了。
en_us: At this time, the looks cast on Lin Li had a certain degree of other meanings to it.

source: 此时的安度因看上去竟是有些苍老，只见他扶着椅子慢慢坐下，将从不离身的水晶球放在身旁，做完这一切之后，却没有回答林立的问题，反倒是忽然问了一句：“你在这里住了有三个月了吧？”
en_us: At this time, Andoine begun to look pale. He held onto the chair, slowly sat down and placed the crystal ball—which he had never allowed to be out of his sight—aside. Thereafter, he did not answered Lin Li’s question. Instead, he asked, “Have you been staying here for three months?”

source: 此时的江逸已经完全没了睡意，他朝窗外望了眼，然后点燃油灯，强忍住疼痛把全身上下二三十处伤口上了些药，然后盘腿坐回到床上。
en_us: At that moment, Jiang Yi had lost all his drowsiness. He quickly looked out the window, before lighting his candle. After enduring the bodily agony from applying medicine on some twenty or thirty wounds throughout his body, he sat cross-legged on his bed.

source: 此时的老梅林，就好象是一个已经掌握了游戏规则的老手，在欺负一个刚刚踏进游戏圈子的新人。
en_us: At this moment, Old Merlin seemed like the veteran who had mastered the rules of the game bullying a newcomer who had just entered the gaming circle.

source: 武堂长老面色更加阴沉了，一只大手元力环绕，大步朝江逸走去，阴冷的声音响彻整个演武殿：“你这畜生伤了人还如此张狂？莫非你以为本座真的不敢杀人？”
en_us: The Martial Court Elder's expression was now even more severe. Circulating the essence force around one of his hands, he took a big step towards Jiang Yi and spoke in a gloomy and cold voice that echoed throughout the entire Martial Arts Demonstration Hall, "How dare you this little bastard be this presumptuous even after injuring all these people? Do you really think I dare not kill you?"

source: 武技按照掌握程度分为入门，精通，大成三个阶段，这翊小姐的暴雨拳三年都没有大成，现在和江逸对战一场就直接大成了？
en_us: The mastery of martial arts techniques were divided into three different levels - namely the Entry, Proficient and Phenomenal stages. How could it be that this Young Mistress Yi's skills in the Thunderstorm Fist technique had not reached the Phenomenal stage in three years worth of training, yet in one practice match against Jiang Yi, she immediately attained "Phenomenal" success?

source: 武殿只为武者服务，每一座武殿内都有聚灵阵，在里面修炼能加速，这里有海量的各阶武技，神兵，丹药，等宝物。这里有重力房，有陪练，机关房等等各种辅助武者提升实力的好地方，只要有紫金，这里就是武者的天堂。
en_us: 聚灵阵The Martial Arts Hall only worked in the service of martial artists. The interior of every Martial Arts Hall contained a spirit concentration spell, allowing anyone cultivating spiritual power inside to increase in speed. There was a huge volume of martial arts techniques, spiritual warriors, elixir pills and a wide variety of other treasures. There were good facilities inside including a Heavy Strengthening Room, provision of sparring partners and a Mechanism Training Room - all sorts of facilities that could help martial artists increase their power. So long as one had purple gold to spend, this place was effectively a heaven for any martial artist.

source: 武殿可不是江家的武堂，那是天羽城内一个很神秘的地方，据说在里面打坐闭关修炼速度能快上两倍，而且里面还有重力室，练功房，专业陪练之类的，是武者修炼的天堂。江逸很早就听说过这武殿，却只能远远的看一眼，因为要想进入武殿修炼，入门费用都需要一两紫金……、
en_us: The martial arts hall was not the main training court of the Jiang Yi, but rather a mysterious location within Skyplume City. According to legend, anyone who meditated there in seclusion could increase their essence force refining speed by up to two times. Additionally, there were many other facilities inside like a strength room, a technique-practicing room, and professional trainers who could facilitate and follow in one's training. In short, it was a martial artists' paradise. Jiang Yi had heard about this martial arts hall ages ago, but he could only eye it from afar, as the entrance fee for even entering the martial arts hall cost a tael of purple gold...

source: 武殿外还在招陪练，不过围观的人少了，江逸刚刚靠近侧门，那高大黑甲护卫立即热情的招呼他道：“嘿，小哥，你可来了，杨管事可是问了你几次啊。”
en_us: The personnel at the Martial Arts Hall were still publicising their call for more sparring partners outside the building, but the surrounding spectators have become fewer in number. Jiang Yi had just walked close to the side door when that big tall guard clad in black armour immediately called out to him and said warmly, "Hey, little man, you're finally here! Manager Yang had asked for you several times."

source: 武殿大门紧闭，侧门倒是打开的，不过有两名黑甲护卫守卫，江逸目光顺着众人定格在武殿外的一张告示上。
en_us: The main doors of the Martial Arts Hall were sealed shut. The side door was indeed open, but there were two guards clad in black armor protecting the entrance. Jiang Yi's gaze followed the crowd and eventually fixed itself on a notice placed outside the Martial Arts Hall.

source: 武殿并不是一股势力，也从不参与大陆纷争，严格来说它应该是天星大陆最大的商号！不过它服务的对象是高级武者和富贵人家的少爷小姐，没有紫府境的实力要想进入武殿，入门必须交纳一两紫金。
en_us: The Martial Arts Hall was not an organized faction. It had no power concentrated in it; neither did it ever get involved in continent-wide conflicts. Strictly speaking, it was the largest business establishment in all of Stellarsky! However, its target customers were highly skilled martial artists and children from rich and powerful families. If one wished to enter the Martial Arts Hall without a level of power in the Purple Mansion Realm, he or she had to pay an entrance fee of a tael of purple gold.

source: 武殿是个很神奇的存在，没有人知道是谁建立的，什么时候建立的，武殿的人也一直很低调，只要不招惹武殿他们从不主动找事，更不参与六国纷争。
en_us: The Martial Arts Hall had a very mysterious existence - no one knew who built it, nor when it was built. The people of the Martial Arts Hall had also always been maintaining a low-profile. So long as no one triggered the ire of the Martial Arts Hall, its people would never actively cause trouble, nor would they ever get involved in six-nation world conflicts.

source: 武殿殿主来转了一圈，算是彻底断绝了杨管事和费老想培养江逸的心思，不过倒是确定江逸的确有一种神奇的能力，能帮武者快速提升武技熟练度。
en_us: The Master of the Martial Arts Hall's supervisory walkabout could be considered to have completely severed Manager Yang and Elder Fei's hopes of grooming and training Jiang Yi. However, he actually confirmed that Jiang Yi did indeed possess a mysterious power, capable of helping martial artists rapidly increase their proficiency level in martial arts techniques.

source: 武殿练功房一个小房间内，江逸结束了一轮修炼，睁开眼睛满脸复杂的感慨道。封印有一万八千枚，现在仅仅才消融四百枚，修炼速度就增幅如此之大，他都不敢想象等封印全部破解会何等的逆天。
en_us: Jiang Yi opened his eyes and mused after a round of cultivation in his tiny room in the Technique Practising Room. There were altogether eighteen thousand runic patterns on the seal, and his cultivation speed had already increased so drastically with just four hundred of them broken. He could hardly wrap his mind around how unnaturally powerful he would be when all of the runic patterns were broken.

source: 武殿虽然不属于城主府管，但姬家在天羽城是土皇帝，杨管事自然不敢得罪姬听雨，江逸也只能苦笑着快步跟随姬听雨进了一个练功房内。
en_us: Although the Martial Arts Hall was not under the administrative purview of the city administration, as the Ji Family was effectively the local lords of the land, Manager Yang naturally did not dare to offend Ji Tingyu. As such, Jiang Yi could only smile bitterly as he followed Ji Tingyu at a quick pace into one of the Technique Practising Rooms.

source: 武殿！
en_us: The Martial Arts Hall!

source: 武者境界的提升，元力会更一步凝练，威力增加！这是大陆人人皆知的常识，他实力达到铸鼎境二重，蓝色元力变幻这很正常，为何这黑色元力也会微微变色，还是颜色变浅？
en_us: As the powers of a martial artist increased in their stages in the Cast Tripod Realm, the essence forces he produced would become even more condensed, and its power would increase greatly! This was common knowledge amongst the people of Stellarsky Continent. It was normal that, with his power reaching the second stage of the Cast Tripod Realm, the properties of his blue essence force would fluctuate. Yet, why was it that that black essence force would experience a slight change in its colours as well - and on top of that, why did the colour become more light?

source: 武者感悟武技，要看悟性和苦练，一般只要悟性足够，任何一门武技大成都是时间问题。如果悟性不够，凭借苦练一辈子都可能达不到精通的地步。在这练功房内，封印了元力，全凭肉体力量和武技对敌，对于武技的掌握程度是有一定的帮助，但绝不可能随便和他对练几场就能大成。
en_us: The mastery of martial art techniques depended on a martial artist's raw talent and
